# Definitions Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
Definitions Members
Definitions Class Constructors Methods Properties See Also
---
The Definitions type exposes the following members.
# Constructors
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Definitions | Constructs an empty set of parameter definitions. |

# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Contains | Tests for the existence of a definition within the set. |
| Create | Creates a new parameter definition using specified options. |
| Dispose | Releases all resources used by the Definitions |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetBasicIEnumerator | Returns an enumerator that iterates through a collection. |
| GetEnumerator | Retrieves an enumerator to the collection. |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsEmpty | Identifies if the definitions collection is empty. |
| Item | Retrieves a definition by a given name. |
| Size | The number of definitions in the collection. |

# See Also
Definitions Class
Autodesk.Revit.DB Namespace